Tekla Open API Reference for Tekla Structures 2025
Assertion Class
 Defines an assertion by the method it failed in and the messages it provided.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Assertion
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Assertion
Public Class Assertion
The Assertion type exposes the following members.
Constructors
Name | Description
Assertion
 Initializes a new instance of the Assertion class.
Top
Properties
Name | Description
DetailedMessage
 Gets the detailed message provided by the assertion.
Message
 Gets the message provided by the assertion.
MethodName
 Gets the name of the method the assertion failed in.
Top
Methods
Name | Description
Equals
 The equals.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets a hash code for this instance. Calculated as recommended at http://msdn.microsoft.com/en-us/library/system.object.gethashcode.aspx
 (Overrides Object.GetHashCode().)
ToString
 The tostring.
 (Overrides Object.ToString().)
Top
See Also
Reference
Tekla.Structures Namespace